tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "aws/tap"
tap "clintmod/formulas"
tap "colindean/fonts-nonfree"
tap "github/gh"
tap "hashicorp/tap"
tap "hpedrorodrigues/tools"
tap "iliyami/macsai"
tap "jandedobbeleer/oh-my-posh"
tap "jannis-baum/tap"
tap "jmespath/jmespath"
tap "kreuzwerker/taps"
tap "libkrun/krun", "https://github.com/libkrun/homebrew-krun.git"
tap "nodenv/nodenv"
tap "null-dev/firefox-profile-switcher"
tap "raine/workmux"
tap "romkatv/powerlevel10k"
tap "strongdm/comply"
tap "vitorgalvao/tiny-scripts"
tap "wyne/tap"
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# High performance key/value database
brew "berkeley-db", link: true
# Collection of portable C++ source libraries
brew "boost"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Multi-shell multi-command argument completer
brew "carapace"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# OpenType text shaping engine
brew "harfbuzz"
# Pure Scala Artifact Fetching
brew "coursier"
# Manage AI coding skills and documentation context
brew "ctx7"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", link: true
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# YAML Parser
brew "libyaml"
# Enterprise friendly way of detecting and preventing secrets in code
brew "detect-secrets"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Tool for managing dock items
brew "dockutil"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Lock file during command
brew "flock"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Replace zsh completion selection menu with fzf
brew "fzf-tab"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Work on GitHub issues on the command-line
brew "ghi"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Browse your latest git branches, formatted real fancy
brew "git-recent"
# Git platform powered by Scala offering
brew "gitbucket"
# Audit git repos for secrets
brew "gitleaks"
# Linting for your git commit messages
brew "gitlint"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# DNS library written in C
brew "ldns"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# CommonMark compliant Markdown formatter
brew "mdformat"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama"
# OCaml package manager
brew "opam"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu", link: false
# Simplistic interactive filtering tool
brew "peco"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Theme for zsh
brew "powerlevel10k"
# RC file (dotfile) management
brew "rcm"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Install various Ruby versions and implementations
brew "ruby-build"
# Safe, concurrent, practical language
brew "rust"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Smart session manager for the terminal
brew "sesh"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Bash syntax highlighter that encourages/fixes variables quoting
brew "shellharden"
# Autoformat shell script source code
brew "shfmt"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Feature-rich console based todo list manager
brew "task"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer", args: ["HEAD"]
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Maintained ctags implementation
brew "universal-ctags"
# Vi 'workalike' with many additional features
brew "vim", link: false
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Antivirus software
cask "avast-security"
# Automated testing of webapps for Google Chrome
cask "chromedriver", args: { appdir: "/Applications" }
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# System-wide audio equaliser
cask "eqmac"
# Create dynamic wallpapers
cask "equinox"
# Web browser
cask "firefox"
# Screen colour temperature controller
cask "flux-app"
cask "font-3270"
cask "font-3270-nerd-font"
cask "font-anonymous-pro"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Neovim Client
cask "neovide-app"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Run commands and display their output on the desktop
cask "ubersicht"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
npm "ccstatusline"
npm "conventional-changelog-conventionalcommits"
npm "conventional-changelog"
npm "corepack"
